app/controllers/lists_controller.rb

	def show
		# If the request is a normal html request
		# render the List in the view as usual.
		#
		# If the request is a json request
		# bundle up all the tasks for the List with the list
		# and send that back to the requester.

		# Rails offers a request object that represents the
		# request received by the action method.
		#
		# This objects exposes useful things such as the
		# response type requested, i.e html, json, etc.

		@list = List.find(params[:id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", "4"]]

	def create
		# When this action is called, routes gives us
		# the parameters needed to create a new list
		#
		# save the list here

		# make object piece by piece
		# @list = List.new
		# @list.name = params["list"]["name"]
		#
		#
		# OR  all at the same time
		#
		# @list = List.new(params[:list])
		#
		# To see what params have been passed use "puts params"

		@list = List.new(params[:list])
		@list.save
---
INSERT INTO "lists" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 03 Aug 2012 00:10:23 UTC +00:00], ["name", "Concerts to Attend this Summer"], ["updated_at", Fri, 03 Aug 2012 00:10:23 UTC +00:00]]

	def destroy
		# Get the thing you want to destroy first
		@list = List.find(params[:id])
		@list.destroy
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]