app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("completed", "created_at", "description", "list_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["completed", nil], ["created_at", Fri, 03 Aug 2012 01:50:07 UTC +00:00], ["description", "sdfgs"], ["list_id", 5], ["updated_at", Fri, 03 Aug 2012 01:50:07 UTC +00:00]]
---
  def create
    #binding.pry
    @task = Task.create(params[:task])

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 13]]
---
  def destroy
    Task.destroy(params[:id])

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 21]]
---
  def complete
    # For each task that is complete, delete it from the Tasks Table.
    for task in params[:task_ids]
      Task.destroy(task)